app/controllers/api/v1/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
      render json: Calendar.all

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
      render json: Calendar.find(params[:id])

INSERT INTO "calendars" ("date", "goal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["date", "8November2019-green"], ["goal_id", 1], ["created_at", "2019-11-06 20:54:17.698652"], ["updated_at", "2019-11-06 20:54:17.698652"]]
---
  def create
      # byebug
      calendar = Calendar.create(calendar_params)