app/controllers/api/v1/goals_controller.rb

  def index
      render json: Goal.all
---
SELECT "goals".* FROM "goals"

  def create
      goal = Goal.create(goal_params)
---
INSERT INTO "goals" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Walking"], ["user_id", 1], ["created_at", "2019-11-07 10:51:15.840298"], ["updated_at", "2019-11-07 10:51:15.840298"]]