app/controllers/application_controller.rb

  def set_current_user
      token = get_token
      if token && token != "null"
          decoded_token = decode_token(token)
          @current_user = User.find(decoded_token["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]